blogku/app/views/posts/show.html.erb

SELECT `comments`.* FROM `comments` WHERE `comments`.`post_id` = 9
---
<h4>Komentar</h4>
<% @post.comments.each do |c| %>