blogku/app/controllers/comments_controller.rb

SELECT  `posts`.* FROM `posts` WHERE `posts`.`id` = 9 LIMIT 1
INSERT INTO `comments` (`author`, `body`, `post_id`, `created_at`, `updated_at`) VALUES ('coba komentar', 'isi komentar', 9, '2015-05-19 03:09:45', '2015-05-19 03:09:45')
---
	def create
		@post = Post.find(params[:post_id])
		@comment = @post.comments.create(params[:comment].permit(:author, :body))