blogku/app/controllers/posts_controller.rb

	def index
		@posts =Post.all.order('created_at DESC').paginate(page: params[:page], per_page: 2)
---
SELECT  `posts`.* FROM `posts`  ORDER BY created_at DESC LIMIT 2 OFFSET 0
SELECT COUNT(*) FROM `posts`

	def create
		@post = Post.new(post_params)

		respond_to do |format|
			if @post.save
---
INSERT INTO `posts` (`title`, `body`, `created_at`, `updated_at`) VALUES ('cona', 'isi cona', '2015-05-11 11:51:38', '2015-05-11 11:51:38')

	def update
		@post = Post.find(params[:id])
		respond_to do |format|
			if @post.update_attributes(post_params)
---
SELECT  `posts`.* FROM `posts` WHERE `posts`.`id` = 11 LIMIT 1
UPDATE `posts` SET `title` = 'artikel baru', `body` = 'coba membuat artikel baru', `updated_at` = '2015-05-19 03:35:40' WHERE `posts`.`id` = 11

	def destroy
		Post.find(params[:id]).destroy
---
DELETE FROM `posts` WHERE `posts`.`id` = 10
SELECT  `posts`.* FROM `posts` WHERE `posts`.`id` = 10 LIMIT 1

	def show
		@post = Post.find(params[:id])
---
SELECT  `posts`.* FROM `posts` WHERE `posts`.`id` = 1 LIMIT 1

	def edit
		@post = Post.find(params[:id])
---
SELECT  `posts`.* FROM `posts` WHERE `posts`.`id` = 9 LIMIT 1