blogku/app/controllers/sessions_controller.rb

SELECT  `admins`.* FROM `admins` WHERE `admins`.`email` = 'ayrokid@gmail.com' LIMIT 1
---
	def create
		admin = Admin.find_by(email: params[:session][:email].downcase)